"""
Создать класс TrafficLight (светофор) и определить у него один атрибут
color (цвет) и метод running (запуск). Атрибут реализовать как приватный.
В рамках метода реализовать переключение светофора в режимы: красный, желтый,
зеленый. Продолжительность первого состояния (красный) составляет 7 секунд,
второго (желтый) — 2 секунды, третьего (зеленый) — на ваше усмотрение.
Переключение между режимами должно осуществляться только в указанном порядке
(красный, желтый, зеленый). Проверить работу примера, создав экземпляр и
вызвав описанный метод.
"""

from time import sleep


class TrafficLight:
    # два жёлтых для того чтобы светофор переключался с зелёного на карасный через жёлтый как это делают реальные светофоры.
    __color = [('красный', 7), ('жёлтый', 2), ('зелёный', 7), ('жёлтый', 2)]

    def running(self):
        count = 0
        while count < 3:
            count += 1
            for state, sw_time in self.__color:
                print(f'Светофор {state}')
                sleep(sw_time)


tl = TrafficLight()
tl.running()
